{
  "president": [
    {
      "name": "Taylor Quach",
      "src": "/assets/img/candidates/cand_tayl.jpg",
      "email": "taylorq1@uci.edu",
      "year": "3",
      "major": "Computer Science",
      "statement": "Hello, everyone! My name is Taylor Quach, and I am currently a third-year Computer Science Major running for Co-President of ICSSC! As a part of ICSSC, I have had the opportunity to serve as a Public Relations Committee Member, Public Relations Chair, and I currently hold the position of Internal Vice President. In addition to my roles within ICSSC, I have also been involved in VenusHacks as a marketing and corporate organizer. Through these experiences, I have organized numerous large events, facilitated communication with companies and various UCI offices, and expanded media outreach within the ICS community. Over the past three years, I have learned the importance of creating a community that allows everyone to grow together socially, academically, and professionally which is something that I want to make sure persists for many years to come!"
    },
    {
      "name": "Meenakshi Mynampati",
      "src": "/assets/img/candidates/cand_meen.jpg",
      "email": "mmynampa@uci.edu",
      "year": "3",
      "major": "Computer Science",
      "statement": "Hi! I'm Meena Mynampati, a 3rd year CS major, running with Taylor Quach for ICSSC Co-president! I've been the Academic and Alumni Affairs chair for the last two years, and was a member of the committee the year before that. I was also Logistics director for my acapella group, and I'm currently an organizer on VenusHack's corporate committee. Having been in ICSSC since my freshman year, I'm so so thankful to have found such a fun and supportive community, and as co-president I would love to continue that legacy!"
    }
  ],
  "ivp": [
    {
      "name": "Jeffrey Meng",
      "src": "/assets/img/candidates/cand_jeff.jpeg",
      "email": "jkm@uci.edu",
      "year": "2",
      "major": "Computer Science",
      "statement": "Hey Everyone! I'm Jeffrey Meng, and I'm currently a second year CS major and the Events Committee Co-Chair of ICSSC. This is my second year as part of ICSSC, and I've really enjoyed getting to meet a bunch of people both within ICSSC and as part of the broader ICS community! I envision ICSSC as a place where our current and new internal members can build meaningful connections with our large internal community, full of people with diverse talents and backgrounds. My goal as IVP will be to greatly strengthen our internal community through a variety of both internal events and other measures to create opportunities for members to interact! In doing so, I also think we'll be able to create new ways for ICSSC to collaborate in better serving the UCI ICS community as a whole."
    }
  ],
  "evp": [
    {
      "name": "Aaditya Borse",
      "src": "/assets/img/candidates/cand_adi.jpg",
      "email": "borsea@uci.edu",
      "year": "2",
      "major": "Computer Science",
      "statement": "Hi! My name is Aaditya Borse and I'm a second year C.S. major at UCI! I am currently the Corporate Chairman at ICSSC and am excited to run for EVP to help our club expand and grow. Networking with other organizations at UCI and other universities is something I want to prioritize to continue ICSSC's mission of supporting the ICS community. Outside of school, I love trying new boba shops and watching sports."
    }
  ]
}