{
  "president": [
    {
      "name": "Kirby Ammari",
      "src": "/assets/img/candidates/kirby.JPG",
      "email": "kammari@uci.edu",
      "year": "2",
      "major": "Computer Science",
      "statement": "Hey everyone! I’m Kirby Ammari, a 2nd-year Computer Science major running for ICSSC’s executive board as a Co-President! I have been a member of ICSSC for 2 years, initially as a Corporate Committee member and now as the Corporate Chair. I’ve also been a logistics organizer for Hack at UCI for a year now, helping with Zothacks, Hack@UCI, and VenusHacks. Through these positions, I’ve gained experience working with and for multiple teams, organizing large events, and building corporate relationships. As a Co-President, I hope to make ICSSC a community for all students to develop their passions and build meaningful relationships at UCI!"
    },
    {
      "name": "Rithvij Pochampally",
      "src": "/assets/img/candidates/rithvij.jpg",
      "email": "rpochamp@uci.edu",
      "year": "2",
      "major": "Computer Science",
      "statement": "Hey y’all! I’m Rithvij Pochampally, a 2nd year Computer Science major running to be next year’s ICSSC’s Co-President. I have been a part of ICSSC for the past 2 years, first as an Events Committee Member and now a Co-Chair for Events Committee. Through ICSSC, I have taken opportunities to grow both academically and socially, meeting numerous friends and colleagues in the process. Being a Co-Chair for Events Committee showed me how much I love to help lead others to create events that help the ICS community. As a Co-President, I’d love to continue this passion of mine and help lead ICSSC in creating a place that people want to take part in!"
    }
  ],
  "ivp": [
    {
      "name": "Taylor Quach",
      "src": "/assets/img/candidates/taylor.jpg",
      "email": "taylorq1@uci.edu",
      "year": "2",
      "major": "Computer Science",
      "statement": "Hi everyone! My name is Taylor Quach and I am currently a 2nd year Computer Science Major. Within ICSSC, I am the Public Relations Committee Chair as well as a mentor in our Bits and Bytes program. As Internal Vice President, I want to encourage both our current members and new and upcoming members to form relations and gain meaningful connections within ICSSC. This past year, I have been responsible for ICSSC's social media presence and keeping members informed of all upcoming opportunities and events. My experience with coordinating with committee members as well as the ICS Student Affairs Office will aid me in coordinating internal socials and multiple avenues for our members to make new friends across committees. If given the opportunity, I would love to make a greater difference within ICSSC and encourage more chances to meet others within the organization."
    }
  ],
  "evp": [
    {
      "name": "Rebecca Ahn",
      "src": "/assets/img/board/RebeccaAhn.png",
      "email": "rebeca2@uci.edu",
      "year": "2",
      "major": "Computer Science",
      "statement": "Hello, my name is Rebecca Ahn, and I'm currently the Events Committee Co-Chair of ICSSC. You may recognize me if you participated in WebJam, Brain Games, and/or weekly events; if not, I hope to meet you at a future event! When directing our big events from the past two quarters, I had the pleasure of working with other ICS clubs. So, I would love to continue the responsibility of actively interacting with all the ICS clubs and organizations, such as creating more inter-ICS club events, throughout next school year."
    },
    {
      "name": "Meenakshi Mynampati",
      "src": "/assets/img/candidates/meena.jpg",
      "email": "mmynampa@uci.edu",
      "year": "2",
      "major": "ICS Undeclared, plan on declaring either CS or Informatics",
      "statement": "Hi! My name is Meena Mynampati, and I'm running for EVP this upcoming year! I believe that I am a good fit for this position because it is very people-facing, and I really enjoy getting to meet and work with new people and groups! In terms of past experience, my position as Academic and Alumni Affairs Chair, as well as my position as Logistics coordinator for my acappella group, prove that I am a good communicator and team player. If I am elected, I would like to collaborate more with the other ICS clubs on campus, perhaps doing more socials or networking events with them! "
    }
  ]
}