[
    {
        "src": "https://www.youtube.com/embed/DuaCkfMMOAQ",
        "title": "Episode 5",
        "date": "December 8, 2019",
        "description": "In this episode of the ICS Podcast, the board of ICS Student Council gives some of their thoughts on their time in the organization, advice as students, and some details on upcoming events and activities! It's our first serious podcast in a long time, so you better seriously listen to it."
    },
    {
        "src": "https://www.youtube.com/embed/-8Q00m_X-b8",
        "title": "Episode 4: Story Time With Avi",
        "date": "November 17,2019",
        "description": "We know ALL of you have been waiting for the ICSSC's next episode of the ICS Podcast since Week 0. We are happy to release our current episode, Story Time with Avi! Hear about how making the Straight Outta Donald Bren meme changed Co-President Avineesh Kompella's life.\n\nGraphic Creds to Kamille Suayan.\nMusic Used - \"Shop\" from Jojo no Kimyou na Bouken (Jojo's Bizzare Adventure) for the Super Famicom, composed by Noboru Yamane"
    },
    {
        "src": "https://www.youtube.com/embed/DuaCkfMMOAQ",
        "title": "Episode 3: ICS ASMR",
        "date": "September 26, 2019",
        "description": "Feeling stressed from the first day of fall quarter classes? Us too... That's why we made this special edition of the ICS Podcast."
    },
    {
        "src": "https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fwww.facebook.com%2FICSStudentCouncil%2Fvideos%2F2431772030210118%2F&show_text=0&width=560",
        "title": "Episode 2",
        "date": "September 22,2019",
        "description": "Aaaaand it's BACK, and just in time for Fall Quarter! The ICS Podcast returns with Episode 2, in which Avi talks about ICSSC and our fellow ICS organizations! Don't forget to catch us at the Anteater Involvement Fair at booth F294, AND to come out to our week 0 general meeting on Tuesday from 5-6 at DBH 6011 to learn more about us, Nerd Fighter, the Bonfire, and other activities, as well as how you can get involved! And while you're at it, make sure to visit all of the ICS clubs at the Anteater Involvement Fair and check out some of the cool stuff they're doing this week!\n\nSpecial thanks to Kathleen Zhou for the podcast logo."
    },
    {
        "src": "https://www.youtube.com/embed/XpagSRzU_n4",
        "title": "Episode 1,",
        "date": "October 7, 2018",
        "description": "In this episode, we invited President of UCI @ Blockchain to talk about blockchain technology and their upcoming Blockathon. We also briefly go over events by ICS clubs in week 2 and 3."
    },
    {
        "src": "https://www.youtube.com/embed/FdIGhENHn1o",
        "title": "Episode 0",
        "date": "October 5, 2018",
        "description": "In our pilot episode, we introduce all the ICS clubs and their events for week 0 and 1. We also go over some tips and advice for this new school year. Thank you for listening!"
    }
]